[M_BadHairDay MissionDefinition]
MissionName="hair loss"
MissionDescription="Mr. Lockhammer asked him to find some balsam hair for his hat. To get Thorosim's hair, punch him, then punch him.."
TurnInDescription="Change hair and get new weapons! Hello everyone! Except for Trotman... He's gone.!"
MissionSummary="Get thick hair.."
MissionGiver="Sir Hammerlock"
MissionTurnInLocation="Sir Hammerlock or Claptrap"
TeaserText="Style is everything."

[M_BadHairDay:GatherAdditionalTufts MissionObjectiveDefinition]
ProgressMessage="Pick up the hair of Toryism"

[M_BadHairDay:GatherAdditionalTuftsSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_BadHairDay:ReturnFurSet MissionObjectiveSetBranchingDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_BadHairDay:ReturntoClaptrap MissionObjectiveDefinition]
ProgressMessage="I'm back in the bracket"

[M_BadHairDay:ReturnToHammerlock MissionObjectiveDefinition]
ProgressMessage="Back to the hammer lock"

